#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

  # module.KEYCLOAK_PROD.module.moh_applications.module.HSIAR.module.client-roles.keycloak_role.ROLES["HI_Consumer"] has changed
  ~ resource "keycloak_role" "ROLES" {
      + attributes = {}
        id         = "103cf2d5-0fad-4092-ad79-3324cf78f279"
        name       = "HI_Consumer"
        # (2 unchanged attributes hidden)
    }

  # module.KEYCLOAK_PROD.module.moh_applications.module.HSIAR.module.client-roles.keycloak_role.ROLES["HI_Operation"] has changed
  ~ resource "keycloak_role" "ROLES" {
      + attributes = {}
        id         = "45c338a2-1f26-4652-ba2d-6987f21c1657"
        name       = "HI_Operation"
        # (2 unchanged attributes hidden)
    }

  # module.KEYCLOAK_PROD.module.moh_applications.module.HSIAR.module.client-roles.keycloak_role.ROLES["HI_ReportProgram_All"] has changed
  ~ resource "keycloak_role" "ROLES" {
      + attributes = {}
        id         = "9e7a6251-bdda-43a7-a739-e4076b7395a7"
        name       = "HI_ReportProgram_All"
        # (2 unchanged attributes hidden)
    }

  # module.KEYCLOAK_PROD.module.moh_applications.module.HSIAR.module.client-roles.keycloak_role.ROLES["HI_ReportProgram_CCHS"] has changed
  ~ resource "keycloak_role" "ROLES" {
      + attributes = {}
        id         = "26f010f1-1777-4274-9ab9-c638d4827fff"
        name       = "HI_ReportProgram_CCHS"
        # (2 unchanged attributes hidden)
    }

  # module.KEYCLOAK_PROD.module.moh_applications.module.HSIAR.module.client-roles.keycloak_role.ROLES["HI_ReportSection_All"] has changed
  ~ resource "keycloak_role" "ROLES" {
      + attributes = {}
        id         = "f5f00923-9d94-44be-ab63-bdfcf469e2b6"
        name       = "HI_ReportSection_All"
        # (2 unchanged attributes hidden)
    }

  # module.KEYCLOAK_PROD.module.moh_applications.module.HSIAR.module.client-roles.keycloak_role.ROLES["HI_ReportSection_CCHS"] has changed
  ~ resource "keycloak_role" "ROLES" {
      + attributes = {}
        id         = "f5a52e1c-0c5a-4a8b-bbf4-8914f30dd5f9"
        name       = "HI_ReportSection_CCHS"
        # (2 unchanged attributes hidden)
    }

  # module.KEYCLOAK_PROD.module.moh_applications.module.USER-MANAGEMENT-SERVICE.module.client-roles.keycloak_role.ROLES["view-client-hsiar"] has changed
  ~ resource "keycloak_role" "ROLES" {
      + attributes = {}
        id         = "1351d750-0ed4-45eb-ae9d-f703869c4dce"
        name       = "view-client-hsiar"
        # (2 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.KEYCLOAK_TEST.module.moh_applications.module.PAS-MANAGEMENT.keycloak_group.GROUP will be created
  + resource "keycloak_group" "GROUP" {
      + id       = (known after apply)
      + name     = "PAS Management"
      + path     = (known after apply)
      + realm_id = "moh_applications"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.PAS-MANAGEMENT.keycloak_group_roles.GROUP_ROLES will be created
  + resource "keycloak_group_roles" "GROUP_ROLES" {
      + exhaustive = true
      + group_id   = (known after apply)
      + id         = (known after apply)
      + realm_id   = "moh_applications"
      + role_ids   = [
          + "06799768-828d-4299-832b-0cc7a56684b0",
          + "68933fe3-7eb8-44d8-b020-beeb54fade3d",
          + "8bea7469-b2b6-4799-b914-91ee2221a15a",
          + "8d594783-7d0a-425b-8e48-56b14f9e5989",
          + "b05e8da8-3737-4684-8523-612d902deaa2",
          + "cc8e2983-2eee-4f21-b47e-4953d272a4fd",
        ]
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pushed by: @filipflorek, Action: `pull_request`*